app/views/recipes/_form.html.erb

SELECT "cuisines".* FROM "cuisines"
---
  <%= f.select(:cuisine_id) do %>
    <% Cuisine.all.each do |c| -%>

SELECT "recipe_types".* FROM "recipe_types"
---
  <%= f.select(:recipe_type_id) do %>
    <% RecipeType.all.each do |c| -%>