app/views/shared/_aside.html.erb

    <h3>Cozinha</h3>
    <% Cuisine.all.each do |cuisine|%>
---
SELECT "cuisines".* FROM "cuisines"

      <h3>Tipos de Receita</h3>
      <% RecipeType.all.each do |recipe_type|%>
---
SELECT "recipe_types".* FROM "recipe_types"