app/controllers/cuisines_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."cuisine_id" = ?  [["cuisine_id", 3]]
---
  def show
    @recipes = Recipe.where(cuisine: params[:id])

INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Americana"], ["created_at", "2018-01-03 12:44:26.654620"], ["updated_at", "2018-01-03 12:44:26.654620"]]
---
  def create
    @cuisine = Cuisine.new cuisine_params
    @cuisine.save ? redirect_to(@cuisine) : render(:new)

UPDATE "cuisines" SET "name" = ?, "updated_at" = ? WHERE "cuisines"."id" = ?  [["name", "aaa"], ["updated_at", "2018-01-11 12:46:26.082222"], ["id", 1]]
---
  def update
    @cuisine.update(cuisine_params) ? redirect_to(@cuisine) : render(edit_cuisine_path(@cuisine))

SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_cuisine
    @cuisine = Cuisine.find(params[:id])