app/controllers/cuisine_controller.rb

SELECT  "cuisines".* FROM "cuisines" WHERE "cuisines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."cuisine_id" = ? LIMIT ?  [["cuisine_id", 1], ["LIMIT", 1]]
---
  def show
    @cuisine = Cuisine.find(params[:id])
    @recipes = Recipe.where(cuisine_id: params[:id]).all

INSERT INTO "cuisines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "nova"], ["created_at", "2018-01-02 13:04:26.042785"], ["updated_at", "2018-01-02 13:04:26.042785"]]
---
  def create
    cuisine = Cuisine.new cuisine_params
    if cuisine.valid?
      cuisine.save