app/controllers/home_controller.rb

  def index
    @recipes = Recipe.all
    @recipes_types = RecipeType.all
    @cuisines = Cuisine.all
---
SELECT "recipes".* FROM "recipes"
SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"