app/controllers/recipes_controller.rb

SELECT "recipe_types".* FROM "recipe_types"
SELECT "cuisines".* FROM "cuisines"
SELECT "recipes".* FROM "recipes"
---
  def index
    @recipes_types = RecipeType.all
    @cuisines = Cuisine.all

    @recipes = if params[:term]
      Recipe.where('title LIKE ?', "%#{params[:term]}%")
    else
      @recipes = Recipe.all