app/controllers/recipe_type_controller.rb

  def show
    @recipe_type = RecipeType.find(params[:id])
    @recipes = Recipe.where(recipe_type_id: params[:id]).all
---
SELECT  "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."recipe_type_id" = ?  [["recipe_type_id", 1]]

  def create
    recipe_type = RecipeType.new(recipe_type_params)

    if recipe_type.valid?
      recipe_type.save
---
INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Sobremesa"], ["created_at", "2018-01-02 22:52:39.194142"], ["updated_at", "2018-01-02 22:52:39.194142"]]