app/controllers/recipe_controller.rb

INSERT INTO "recipes" ("title", "cuisine_id", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "method", "recipe_type_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    recipe = Recipe.create(recipe_params)