app/controllers/recipe_types_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."recipe_type_id" = ?  [["recipe_type_id", 1]]
---
  def show
    @recipes = Recipe.where(recipe_type_id: params[:id])

INSERT INTO "recipe_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Russa"], ["created_at", "2018-01-10 23:28:27.332177"], ["updated_at", "2018-01-10 23:28:27.332177"]]
---
  def create
    @recipe_type = RecipeType.new(recipe_type_params)
    @recipe_type.save ? redirect_to(@recipe_type) : render(:new)

SELECT  "recipe_types".* FROM "recipe_types" WHERE "recipe_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_recipe_type
    @recipe_type = RecipeType.find(params[:id])