app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.author = current_user
    if @recipe.save
---
INSERT INTO "recipes" ("title", "cuisine_id", "difficulty", "cook_time", "created_at", "updated_at", "ingredients", "method", "recipe_type_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Bolo de coco"], ["updated_at", "2018-01-11 12:41:29.354571"], ["id", 1]]

  def favorite
    @recipes = Recipe.where(favorite: true)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."favorite" = ?  [["favorite", "t"]]

  def new_favorite
    recipe = Recipe.find params[:id]
    recipe.update(favorite: !recipe.favorite)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "recipes" SET "favorite" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["favorite", "t"], ["updated_at", "2018-01-12 22:19:20.190850"], ["id", 5]]

  def find_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]