app/views/recipe/new.html.erb

SELECT  "cuisines".* FROM "cuisines" ORDER BY "cuisines"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  <%= f.select(:cuisine_id) do %>
    <% Cuisine.all.each do |c| -%>

SELECT "recipe_types".* FROM "recipe_types"
---
  <%= f.select(:recipe_type_id) do %>
    <% RecipeType.all.each do |c| -%>